In [1]:
import numpy as np
import pandas as pd

In [4]:
data=np.random.randn(3,4)

In [5]:
data

array([[-0.92555735,  0.52635813, -0.25268545,  0.17655434],
       [-1.46193303,  0.52637357, -0.69349777,  0.20344233],
       [-1.25803716,  0.35544713,  0.051229  ,  1.31217729]])

In [6]:
dataFrame=pd.DataFrame(data)

In [7]:
dataFrame

          0         1         2         3
0 -0.925557  0.526358 -0.252685  0.176554
1 -1.461933  0.526374 -0.693498  0.203442
2 -1.258037  0.355447  0.051229  1.312177

In [8]:
dataFrame[0]

0   -0.925557
1   -1.461933
2   -1.258037
Name: 0, dtype: float64

In [9]:
type(dataFrame[0])

pandas.core.series.Series

In [105]:
yeniDataFrame=pd.DataFrame(data,index=["Hasan","Ozcan","Mehmet"],columns=["maas","yas","calisma","sure"])

In [89]:
yeniDataFrame

            maas       yas   calisma      sure
Hasan  -0.925557  0.526358 -0.252685  0.176554
Özcan  -1.461933  0.526374 -0.693498  0.203442
Mehmet -1.258037  0.355447  0.051229  1.312177

In [90]:
yeniDataFrame["maas"]

Hasan    -0.925557
Özcan    -1.461933
Mehmet   -1.258037
Name: maas, dtype: float64

In [91]:
yeniDataFrame["calisma"]

Hasan    -0.252685
Özcan    -0.693498
Mehmet    0.051229
Name: calisma, dtype: float64

In [92]:
yeniDataFrame[["maas","yas"]]

            maas       yas
Hasan  -0.925557  0.526358
Özcan  -1.461933  0.526374
Mehmet -1.258037  0.355447

In [93]:
yeniDataFrame.iloc[0,:] ## index

maas      -0.925557
yas        0.526358
calisma   -0.252685
sure       0.176554
Name: Hasan, dtype: float64

In [94]:
yeniDataFrame.loc["Hasan"] ##key

maas      -0.925557
yas        0.526358
calisma   -0.252685
sure       0.176554
Name: Hasan, dtype: float64

In [95]:
yeniDataFrame

            maas       yas   calisma      sure
Hasan  -0.925557  0.526358 -0.252685  0.176554
Özcan  -1.461933  0.526374 -0.693498  0.203442
Mehmet -1.258037  0.355447  0.051229  1.312177

In [96]:
yeniDataFrame["emeklilik"]=yeniDataFrame["yas"]*5

In [97]:
yeniDataFrame

            maas       yas   calisma      sure  emeklilik
Hasan  -0.925557  0.526358 -0.252685  0.176554   2.631791
Özcan  -1.461933  0.526374 -0.693498  0.203442   2.631868
Mehmet -1.258037  0.355447  0.051229  1.312177   1.777236

In [98]:
yeniDataFrame.drop("emeklilik",axis=1)

            maas       yas   calisma      sure
Hasan  -0.925557  0.526358 -0.252685  0.176554
Özcan  -1.461933  0.526374 -0.693498  0.203442
Mehmet -1.258037  0.355447  0.051229  1.312177

In [99]:
yeniDataFrame.drop("Mehmet",axis=0)

           maas       yas   calisma      sure  emeklilik
Hasan -0.925557  0.526358 -0.252685  0.176554   2.631791
Özcan -1.461933  0.526374 -0.693498  0.203442   2.631868

In [100]:
yeniDataFrame.drop("emeklilik",axis=1,inplace=True)

In [101]:
yeniDataFrame

            maas       yas   calisma      sure
Hasan  -0.925557  0.526358 -0.252685  0.176554
Özcan  -1.461933  0.526374 -0.693498  0.203442
Mehmet -1.258037  0.355447  0.051229  1.312177

In [102]:
yeniDataFrame.loc["Hasan"]["maas"]

-0.9255573453439115

In [106]:
yeniDataFrame.loc["Ozcan","yas"]

0.5263735679272095

In [108]:
booleanFrame=yeniDataFrame<0

In [109]:
yeniDataFrame[booleanFrame]

            maas  yas   calisma  sure
Hasan  -0.925557  NaN -0.252685   NaN
Ozcan  -1.461933  NaN -0.693498   NaN
Mehmet -1.258037  NaN       NaN   NaN

In [110]:
yeniDataFrame[yeniDataFrame>0]

        maas       yas   calisma      sure
Hasan    NaN  0.526358       NaN  0.176554
Ozcan    NaN  0.526374       NaN  0.203442
Mehmet   NaN  0.355447  0.051229  1.312177

In [112]:
yeniDataFrame["yas"]>0

Hasan     True
Ozcan     True
Mehmet    True
Name: yas, dtype: bool

In [117]:
yeniDataFrame[yeniDataFrame['calisma']<0] ## the filtering process

           maas       yas   calisma      sure
Hasan -0.925557  0.526358 -0.252685  0.176554
Ozcan -1.461933  0.526374 -0.693498  0.203442

In [121]:
yeniDataFrame

            maas       yas   calisma      sure
Hasan  -0.925557  0.526358 -0.252685  0.176554
Ozcan  -1.461933  0.526374 -0.693498  0.203442
Mehmet -1.258037  0.355447  0.051229  1.312177

In [197]:
yeniDataFrame.reset_index()

  index      maas       yas   calisma      sure yeniin
0   HAS -0.925557  0.526358 -0.252685  0.176554    HAS
1   OZC -1.461933  0.526374 -0.693498  0.203442    OZC
2   MEH -1.258037  0.355447  0.051229  1.312177    MEH

In [198]:
yeniDataFrame

         maas       yas   calisma      sure yeniin
HAS -0.925557  0.526358 -0.252685  0.176554    HAS
OZC -1.461933  0.526374 -0.693498  0.203442    OZC
MEH -1.258037  0.355447  0.051229  1.312177    MEH

In [125]:
yeniDataFrame.index

Index(['Hasan', 'Ozcan', 'Mehmet'], dtype='object')

In [206]:
yeniIndeksListesi=["HAS","OZC","MEH"]

In [207]:
yeniDataFrame

         maas       yas   calisma      sure yeniin
HAS -0.925557  0.526358 -0.252685  0.176554    HAS
OZC -1.461933  0.526374 -0.693498  0.203442    OZC
MEH -1.258037  0.355447  0.051229  1.312177    MEH

In [208]:
yeniDataFrame["yeniin"]=yeniIndeksListesi

In [213]:
yeniDataFrame

  index      maas       yas   calisma      sure yeniin
0   HAS -0.925557  0.526358 -0.252685  0.176554    HAS
1   OZC -1.461933  0.526374 -0.693498  0.203442    OZC
2   MEH -1.258037  0.355447  0.051229  1.312177    MEH

In [214]:
yeniDataFrame.set_index("yeniin")

       index      maas       yas   calisma      sure
yeniin
HAS      HAS -0.925557  0.526358 -0.252685  0.176554
OZC      OZC -1.461933  0.526374 -0.693498  0.203442
MEH      MEH -1.258037  0.355447  0.051229  1.312177

In [215]:
yeniDataFrame.set_index("yeniin",inplace=True)

In [216]:
yeniDataFrame

       index      maas       yas   calisma      sure
yeniin
HAS      HAS -0.925557  0.526358 -0.252685  0.176554
OZC      OZC -1.461933  0.526374 -0.693498  0.203442
MEH      MEH -1.258037  0.355447  0.051229  1.312177

In [217]:
yeniDataFrame

       index      maas       yas   calisma      sure
yeniin
HAS      HAS -0.925557  0.526358 -0.252685  0.176554
OZC      OZC -1.461933  0.526374 -0.693498  0.203442
MEH      MEH -1.258037  0.355447  0.051229  1.312177

In [219]:
yeniDataFrame.loc["HAS"]

index           HAS
maas      -0.925557
yas        0.526358
calisma   -0.252685
sure       0.176554
Name: HAS, dtype: object

In [220]:
ilkIndeksler=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [221]:
ilkIndeksler

['Simpson', 'Simpson', 'Simpson', 'South Park', 'South Park', 'South Park']

In [222]:
icIndeksler=["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [223]:
birlesmisIndeks=list(zip(ilkIndeksler,icIndeksler))

In [224]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [225]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [226]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [227]:
type(birlesmisIndeks)

pandas.core.indexes.multi.MultiIndex

In [228]:
cizgifilmlistem=[[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [229]:
cizgifilmlistem

[[40, 'A'], [10, 'B'], [30, 'C'], [9, 'D'], [10, 'E'], [11, 'F']]

In [230]:
cizgifilmnumpydizisi=np.array(cizgifilmlistem)

In [231]:
cizgifilmnumpydizisi

array([['40', 'A'],
       ['10', 'B'],
       ['30', 'C'],
       ['9', 'D'],
       ['10', 'E'],
       ['11', 'F']], dtype='<U11')

In [238]:
cizgiFilmDataFrame=pd.DataFrame(index=birlesmisIndeks,data=cizgifilmnumpydizisi,columns=["Yas","Meslek"])

In [239]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [243]:
cizgiFilmDataFrame.loc["Simpson"].loc["Homer"]

Yas       40
Meslek     A
Name: Homer, dtype: object

In [245]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [247]:
cizgiFilmDataFrame.index.names=["Film Adı","isim"]

In [248]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   isim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F